#pragma once

typedef struct PLAYER_STATS {
float food;                         //+0x0
float wood;                         //+0x4
float stone;                        //+0x8
float gold;                         //+0xC
float pop_left;                     //+0x10
float unknown6;                     //+0x14
float current_age;                  //+0x18
float num_relics;                   //+0x1C
float unknown9;                     //+0x20
float unknown10;                    //+0x24
float unknown11;                    //+0x28
float pop_current;                  //+0x2C
float unknown13;                    //+0x30
float unknown14;                    //+0x34
float unknown15;                    //+0x38
float unknown16;                    //+0x3C
float unknown17;                    //+0x40
float unknown18;                    //+0x44
float unknown19;                    //+0x48
float total_units_created;          //+0x4C
float num_kills;                    //+0x50
float num_items_researched;         //+0x54
float percent_map_explored;         //+0x58
float unknown24;                    //+0x5C
float unknown25;                    //+0x60
float unknown26;                    //+0x64
float unknown27;                    //+0x68
float unknown28;                    //+0x6C
float unknown29;                    //+0x70
float unknown30;                    //+0x74
float unknown31;                    //+0x78
float unknown32;                    //+0x7C
float pop_max;                      //+0x80
float unknown34;                    //+0x84
float unknown35;                    //+0x88
float unknown36;                    //+0x8C
float farm_food;                    //+0x90
float num_villagers;                //+0x94
float unknown39;                    //+0x98
float unknown40;                    //+0x9C
float num_military;                 //+0xA0
float unknown42;                    //+0xA4
float num_wonders;                  //+0xA8
float unknown44;                    //+0xAC
float unknown45;                    //+0xB0
float unknown46;                    //+0xB4
float unknown47;                    //+0xB8
float unknown48;                    //+0xBC
float unknown49;                    //+0xC0
float total_gold_gathered;          //+0xC4
float unknown51;                    //+0xC8
float unknown52;                    //+0xCC
float unknown53;                    //+0xD0
float total_resources_tributed;     //+0xD4
float unknown55;                    //+0xD8
float unknown56;                    //+0xDC
float unknown57;                    //+0xE0
float unknown58;                    //+0xE4
float unknown59;                    //+0xE8
float unknown60;                    //+0xEC
float unknown61;                    //+0xF0
float unknown62;                    //+0xF4
float unknown63;                    //+0xF8
float unknown64;                    //+0xFC
float unknown65;                    //+0x100
float unknown66;                    //+0x104
float unknown67;                    //+0x108
float unknown68;                    //+0x10C
float unknown69;                    //+0x110
float total_team_kills;             //+0x114
float unknown71;                    //+0x118
float unknown72;                    //+0x11C
float unknown73;                    //+0x120
float unknown74;                    //+0x124
float unknown75;                    //+0x128
float unknown76;                    //+0x12C
float unknown77;                    //+0x130
float unknown78;                    //+0x134
float unknown79;                    //+0x138
float unknown80;                    //+0x13C
float num_units_queued;             //+0x140
float num_units_making;             //+0x144
float unknown83;                    //+0x148
float unknown84;                    //+0x14C
float unknown85;                    //+0x150
float unknown86;                    //+0x154
float unknown87;                    //+0x158
float unknown88;                    //+0x15C
float unknown89;                    //+0x160
float unknown90;                    //+0x164
float unknown91;                    //+0x168
float civ_food_bonus;               //+0x16C
float civ_wood_bonus;               //+0x170
float civ_stone_bonus;              //+0x174
float civ_gold_bonus;               //+0x178
float unknown96;                    //+0x17C
float unknown97;                    //+0x180
float unknown98;                    //+0x184
float total_civ_worth;              //+0x188
float total_food_spent_on_upgrades; //+0x18C
float unknown101;                   //+0x190
float total_trading_gold;           //+0x194
float p1_res_tributed_to;           //+0x198
float p2_res_tributed_to;           //+0x19C
float p3_res_tributed_to;           //+0x1A0
float p4_res_tributed_to;           //+0x1A4
float p5_res_tributed_to;           //+0x1A8
float p6_res_tributed_to;           //+0x1AC
float p7_res_tributed_to;           //+0x1B0
float p8_res_tributed_to;           //+0x1B4
float p1_unit_kill_worth;           //+0x1B8
float p2_unit_kill_worth;           //+0x1BC
float p3_unit_kill_worth;           //+0x1C0
float p4_unit_kill_worth;           //+0x1C4
float p5_unit_kill_worth;           //+0x1C8
float p6_unit_kill_worth;           //+0x1CC
float p7_unit_kill_worth;           //+0x1D0
float p8_unit_kill_worth;           //+0x1D4
float p1_building_raze_count;       //+0x1D8
float p2_building_raze_count;       //+0x1DC
float p3_building_raze_count;       //+0x1E0
float p4_building_raze_count;       //+0x1E4
float p5_building_raze_count;       //+0x1E8
float p6_building_raze_count;       //+0x1EC
float p7_building_raze_count;       //+0x1F0
float p8_building_raze_count;       //+0x1F4
float p1_building_raze_worth;       //+0x1F8
float p2_building_raze_worth;       //+0x1FC
float p3_building_raze_worth;       //+0x200
float p4_building_raze_worth;       //+0x204
float p5_building_raze_worth;       //+0x208
float p6_building_raze_worth;       //+0x20C
float p7_building_raze_worth;       //+0x210
float p8_building_raze_worth;       //+0x214
float num_castles;                  //+0x218
float unknown136;                   //+0x21C
float unknown137;                   //+0x220
float unknown138;                   //+0x224
float unknown139;                   //+0x228
float unknown140;                   //+0x22C
float unknown141;                   //+0x230
float unknown142;                   //+0x234
float unknown143;                   //+0x238
float unknown144;                   //+0x23C
float unknown145;                   //+0x240
float unknown146;                   //+0x244
float unknown147;                   //+0x248
float unknown148;                   //+0x24C
float unknown149;                   //+0x250
float unknown150;                   //+0x254
float unknown151;                   //+0x258
float unknown152;                   //+0x25C
float unknown153;                   //+0x260
float unknown154;                   //+0x264
float unknown155;                   //+0x268
float unknown156;                   //+0x26C
float p1_res_trbiuted_from;         //+0x270
float p2_res_trbiuted_from;         //+0x274
float p3_res_trbiuted_from;         //+0x278
float p4_res_trbiuted_from;         //+0x27C
float p5_res_trbiuted_from;         //+0x280
float p6_res_trbiuted_from;         //+0x284
float p7_res_trbiuted_from;         //+0x288
float p8_res_trbiuted_from;         //+0x28C
float current_unit_worth;           //+0x290
float current_building_worth;       //+0x294
float total_food_gathered;          //+0x298
float total_wood_gathered;          //+0x29C
float total_stone_gathered;         //+0x2A0
float total_gold_gathered2;         //+0x2A4
float total_kill_raze_worth;        //+0x2A8
float total_res_tribute_recieved;   //+0x2AC
float unknown173;                   //+0x2B0
float castle_high;                  //+0x2B4
float wonder_high;                  //+0x2B8
float total_res_tribute_sent;       //+0x2BC
float unknown177;                   //+0x2C0
float unknown178;                   //+0x2C4
float unknown179;                   //+0x2C8
float unknown180;                   //+0x2CC
float unknown181;                   //+0x2D0
float unknown182;                   //+0x2D4
float unknown183;                   //+0x2D8
float unknown184;                   //+0x2DC
float total_stone_castle_wonder;    //+0x2E0
float unknown186;                   //+0x2E4
float unknown187;                   //+0x2E8
float unknown188;                   //+0x2EC
float unknown189;                   //+0x2F0
float unknown190;                   //+0x2F4
float unknown191;                   //+0x2F8
float unknown192;                   //+0x2FC
float unknown193;                   //+0x300
float unknown194;                   //+0x304
float unknown195;                   //+0x308
float unknown196;                   //+0x30C
float unknown197;                   //+0x310
float unknown198;                   //+0x314
} player_stats, *pplayer_stats;